MooringCube/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet
    {
        type            waveVelocity;
        refValue        uniform ( 0 0 0 ); 
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 1;
        value           uniform ( 0 0 0 ); 
    }

    outlet
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }

    ground
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }

    walls
    {
        type            slip;
    }

    atmosphere
    {
        type            pressureInletOutletVelocity;
	value		uniform (0 0 0);
    }

    floatingObject
    {
        type            movingWallVelocity;
	value		uniform (0 0 0);
    }

    overset
    {
        type            overset;
    }

    sides
    {
        type            overset;
    }
}

// ************************************************************************* //
