MooringCube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-5  -1 -0.5)
    (5   -1 -0.5)
    (5    1.6 -0.5)
    (-5   1.6 -0.5)
    (-5  -1 1.5)
    (5   -1 1.5)
    (5    1.6 1.5)
    (-5   1.6 1.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 52 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    oversetPatch
    {
        type overset;
        faces ();
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    walls
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
