MooringCube/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("liboverset.so");

application     overInterDyMFoam ;

startFrom       latestTime;

startTime       0.0;

stopAt          firstTime;

endTime         10;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           2.0;
maxAlphaCo      2.0;
maxDeltaT       1;

functions
{
    freeSurface
    {
        type            surfaces;
        libs            ("libsampling.so");

        // Name of the directory for probe data
        name            surfaces;

        // Write at same frequency as fields
        writeControl    outputTime;
        writeInterval   1;
	surfaceFormat	stl;
	interpolationScheme	cellPoint


        surfaces
        (
      	   topFreeSurface	
		{
			type	isoSurface;
			isoField	alpha.water;
			isoValue	0.5;
			interpolate	true;
		}	
        );

        // Fields to be probed
        fields          alpha.water;

    }


}

// ************************************************************************* //
