MooringCube/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  regionToCell;
	sourceInfo
	{
        	insidePoints ((0.0 0.0 0.2));
	}
    }

    {
        name    c1;
        type    cellSet;
        action  new;
        source  cellToCell;
	sourceInfo
	{
        	set     c0;
	}
    }

    {
        name    c1;
        type    cellSet;
        action  invert;
    }
);

// ************************************************************************* //
